In [3]:
import pandas as pd
import numpy as np

pd.set_option("display.float_format", "{:,.2f}".format)

# Load data
df = pd.read_csv("travel_bookings_corporate_2022_2024.csv", parse_dates=[
    "booking_date", "travel_start_date", "travel_end_date"
])

df.head()

,trip_id,employee_id,employee_department,employee_level,cost_center,travel_purpose,home_region,home_country,home_city,trip_region,...,is_preferred_supplier,is_policy_compliant,policy_violation_reason,negotiated_rate_flag,savings_vs_public_rate_eur,co2_kg,on_time_performance,service_sla_hours,complaint_flag,nps_score
0,T0000001,E00176,Operations,Junior,CC-033,Internal Meeting,Europe,Denmark,Aarhus,Europe,...,True,False,Late booking,False,0.00,85,NaN,22.60,False,-70
1,T0000002,E01097,Sales,Junior,CC-026,Client Meeting,APAC,Australia,Sydney,Europe,...,True,False,Over budget,True,15.37,43,NaN,12.60,False,-70
2,T0000003,E00204,Sales,Junior,CC-019,Training,APAC,Australia,Sydney,APAC,...,True,True,NaN,True,147.48,249,NaN,7.90,False,-10
3,T0000004,E00030,Sales,Senior,CC-022,Client Meeting,Americas,Brazil,Sao Paulo,Europe,...,True,True,NaN,True,252.68,687,96.42,18.00,False,20
4,T0000005,E01101,Operations,Junior,CC-068,Client Meeting,APAC,Japan,Tokyo,Americas,...,True,True,NaN,False,0.00,608,77.68,4.90,False,70

In [6]:
df.shape

(20000, 41)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 41 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   trip_id                     20000 non-null  object
 1   employee_id                 20000 non-null  object
 2   employee_department         20000 non-null  object
 3   employee_level              20000 non-null  object
 4   cost_center                 20000 non-null  object
 5   travel_purpose              20000 non-null  object
 6   home_region                 20000 non-null  object
 7   home_country                20000 non-null  object
 8   home_city                   20000 non-null  object
 9   trip_region                 20000 non-null  object
 10  destination_country         20000 non-null  object
 11  destination_city            20000 non-null  object
 12  category                    20000 non-null  object
 13  booking_channel             20000 non-null  object
 14  booking_date                20000 non-null  datetime64[ns]
 15  travel_start_date           20000 non-null  datetime64[ns]
 16  travel_end_date             20000 non-null  datetime64[ns]
 17  trip_length_days            20000 non-null  int64
 18  days_in_advance             20000 non-null  int64
 19  distance_km                 20000 non-null  int64
 20  cabin_class                 9013 non-null   object
 21  hotel_star_rating           5999 non-null   float64
 22  car_group                   2013 non-null   object
 23  rail_class                  1978 non-null   object
 24  supplier_name               20000 non-null  object
 25  base_fare                   20000 non-null  int64
 26  taxes_fees                  20000 non-null  float64
 27  total_cost                  20000 non-null  float64
 28  currency                    20000 non-null  object
 29  fx_to_eur                   20000 non-null  float64
 30  total_cost_eur              20000 non-null  float64
 31  is_preferred_supplier       20000 non-null  bool
 32  is_policy_compliant         20000 non-null  bool
 33  policy_violation_reason     3479 non-null   object
 34  negotiated_rate_flag        20000 non-null  bool
 35  savings_vs_public_rate_eur  20000 non-null  float64
 36  co2_kg                      20000 non-null  int64
 37  on_time_performance         10991 non-null  float64
 38  service_sla_hours           20000 non-null  float64
 39  complaint_flag              20000 non-null  bool
 40  nps_score                   20000 non-null  int64
dtypes: bool(4), datetime64[ns](3), float64(8), int64(6), object(20)
memory usage: 5.7+ MB

In [8]:
df.describe(include="all").transpose().head(20)

,count,unique,top,freq,mean,min,25%,50%,75%,max,std
trip_id,20000,20000,T0000001,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
employee_id,20000,1200,E00117,32,NaN,NaN,NaN,NaN,NaN,NaN,NaN
employee_department,20000,6,Operations,5993,NaN,NaN,NaN,NaN,NaN,NaN,NaN
employee_level,20000,4,Junior,9082,NaN,NaN,NaN,NaN,NaN,NaN,NaN
cost_center,20000,70,CC-026,335,NaN,NaN,NaN,NaN,NaN,NaN,NaN
travel_purpose,20000,6,Client Meeting,6014,NaN,NaN,NaN,NaN,NaN,NaN,NaN
home_region,20000,4,Europe,8980,NaN,NaN,NaN,NaN,NaN,NaN,NaN
home_country,20000,20,Poland,1336,NaN,NaN,NaN,NaN,NaN,NaN,NaN
home_city,20000,42,Singapore,999,NaN,NaN,NaN,NaN,NaN,NaN,NaN
trip_region,20000,4,Europe,9971,NaN,NaN,NaN,NaN,NaN,NaN,NaN
destination_country,20000,20,Germany,1483,NaN,NaN,NaN,NaN,NaN,NaN,NaN
destination_city,20000,42,Singapore,805,NaN,NaN,NaN,NaN,NaN,NaN,NaN
category,20000,5,Flight,9013,NaN,NaN,NaN,NaN,NaN,NaN,NaN
booking_channel,20000,3,TMC,12989,NaN,NaN,NaN,NaN,NaN,NaN,NaN
booking_date,20000,NaN,NaN,NaN,2023-07-03 12:25:16.320000,2022-01-01 00:00:00,2022-10-03 00:00:00,2023-07-06 00:00:00,2024-04-03 00:00:00,2024-12-30 00:00:00,NaN
travel_start_date,20000,NaN,NaN,NaN,2023-08-01 07:57:38.880000,2022-01-02 00:00:00,2022-11-02 00:00:00,2023-08-02 00:00:00,2024-05-03 00:00:00,2024-12-31 00:00:00,NaN
travel_end_date,20000,NaN,NaN,NaN,2023-08-05 07:54:15.840000,2022-01-07 00:00:00,2022-11-06 00:00:00,2023-08-06 00:00:00,2024-05-07 00:00:00,2025-01-07 00:00:00,NaN
trip_length_days,"20,000.00",NaN,NaN,NaN,4.00,1.00,2.00,4.00,6.00,7.00,2.00
days_in_advance,"20,000.00",NaN,NaN,NaN,29.48,0.00,15.00,30.00,44.00,59.00,17.26
distance_km,"20,000.00",NaN,NaN,NaN,"4,645.21",300.00,"2,502.75","4,669.00","6,808.00","8,999.00","2,492.98"

In [9]:
df.isna().sum().sort_values(ascending=False).head(20)

rail_class                    18022
car_group                     17987
policy_violation_reason       16521
hotel_star_rating             14001
cabin_class                   10987
on_time_performance            9009
co2_kg                            0
savings_vs_public_rate_eur        0
negotiated_rate_flag              0
is_policy_compliant               0
service_sla_hours                 0
total_cost_eur                    0
fx_to_eur                         0
currency                          0
total_cost                        0
taxes_fees                        0
base_fare                         0
supplier_name                     0
complaint_flag                    0
is_preferred_supplier             0
dtype: int64

In [10]:
df["policy_violation_reason"] = df["policy_violation_reason"].fillna("Compliant")

In [3]:
## 3. Feature Engineering
#- `year`, `month`, `year_month`
#- `booking_window` buckets
#- `is_late_booking` flag
#- `co2_tons`

In [13]:
# Time features
df["year"] = df["travel_start_date"].dt.year
df["month"] = df["travel_start_date"].dt.month
df["year_month"] = df["travel_start_date"].dt.to_period("M").astype(str)

# Booking window buckets
bins = [-1, 3, 7, 14, 30, 365]
labels = ["0–3 days", "4–7 days", "8–14 days", "15–30 days", "30+ days"]

df["booking_window_bucket"] = pd.cut(df["days_in_advance"], bins=bins, labels=labels)

# Late booking flag (0–3 days)
df["is_late_booking"] = df["days_in_advance"] <= 3

# CO2 in tons
df["co2_tons"] = df["co2_kg"] / 1000

df[["travel_start_date", "year", "year_month", "days_in_advance", "booking_window_bucket", "is_late_booking", "co2_tons"]].head()

,travel_start_date,year,year_month,days_in_advance,booking_window_bucket,is_late_booking,co2_tons
0,2023-03-12,2023,2023-03,44,30+ days,False,0.09
1,2022-05-28,2022,2022-05,55,30+ days,False,0.04
2,2024-10-27,2024,2024-10,23,15–30 days,False,0.25
3,2022-04-14,2022,2022-04,54,30+ days,False,0.69
4,2024-01-29,2024,2024-01,31,30+ days,False,0.61

In [2]:
## 4. Core KPIs
#- Total spend (EUR)
#- Total trips
#- Average cost per trip
#- Policy compliance rate
#- Preferred supplier usage
#- CO₂ emissions

In [16]:
total_spend_eur = df["total_cost_eur"].sum()
total_trips = df["trip_id"].nunique()
avg_cost_per_trip = total_spend_eur / total_trips

policy_compliance_rate = df["is_policy_compliant"].mean() * 100
preferred_supplier_rate = df["is_preferred_supplier"].mean() * 100

total_co2_tons = df["co2_tons"].sum()

kpis = {
    "Total Spend (EUR)": total_spend_eur,
    "Total Trips": total_trips,
    "Avg Cost per Trip (EUR)": avg_cost_per_trip,
    "Policy Compliance (%)": policy_compliance_rate,
    "Preferred Supplier Usage (%)": preferred_supplier_rate,
    "Total CO₂ Emissions (tons)": total_co2_tons
}

pd.Series(kpis).to_frame("Value")

                                     Value
Total Spend (EUR)            25,634,247.80
Total Trips                      20,000.00
Avg Cost per Trip (EUR)           1,281.71
Policy Compliance (%)                82.60
Preferred Supplier Usage (%)         75.44
Total CO₂ Emissions (tons)        8,708.69

In [4]:
## 5. Spend Analysis
#- Category (Flight, Hotel, Car, Rail, M&E)
#- Region
#- Department
#- Booking channel
#- Year

In [18]:
spend_by_category = (
    df.groupby("category")["total_cost_eur"]
      .sum()
      .reset_index()
      .sort_values("total_cost_eur", ascending=False)
)

spend_by_category

            category  total_cost_eur
1             Flight   11,197,887.54
3  Meetings & Events    8,691,525.18
2              Hotel    4,523,389.33
0                Car      756,701.25
4               Rail      464,744.50

In [19]:
spend_by_region = (
    df.groupby("trip_region")["total_cost_eur"]
      .sum()
      .reset_index()
      .sort_values("total_cost_eur", ascending=False)
)

spend_by_region

  trip_region  total_cost_eur
2      Europe   12,933,400.70
1    Americas    5,102,666.62
0        APAC    4,999,023.39
3         MEA    2,599,157.09

In [20]:
spend_by_department = (
    df.groupby("employee_department")["total_cost_eur"]
      .sum()
      .reset_index()
      .sort_values("total_cost_eur", ascending=False)
)

spend_by_department

  employee_department  total_cost_eur
3          Operations    7,748,242.63
5               Sales    6,194,471.56
2                  IT    3,810,011.47
0             Finance    3,162,180.92
4         Procurement    2,756,839.96
1                  HR    1,962,501.26

In [21]:
spend_by_channel = (
    df.groupby("booking_channel")["total_cost_eur"]
      .sum()
      .reset_index()
      .sort_values("total_cost_eur", ascending=False)
)

spend_by_channel

        booking_channel  total_cost_eur
2                   TMC   16,893,172.44
1           Online Tool    6,277,444.53
0  Direct with Supplier    2,463,630.83

In [22]:
monthly_spend = (
    df.groupby("year_month")["total_cost_eur"]
      .sum()
      .reset_index()
      .sort_values("year_month")
)

monthly_spend.head()

  year_month  total_cost_eur
0    2022-01      197,111.38
1    2022-02      499,435.08
2    2022-03      690,133.09
3    2022-04      766,216.64
4    2022-05      735,309.02

In [5]:
## 6. Cost Drivers & Savings Opportunities
#- Impact of booking window on cost
#- Spend by cabin class (for flights)
#- Savings from negotiated rates

In [24]:
avg_cost_by_window = (
    df.groupby("booking_window_bucket")["total_cost_eur"]
      .mean()
      .reset_index()
      .sort_values("booking_window_bucket")
)

avg_cost_by_window

/var/folders/k5/_9fs3wns2k526hfgjvkt61k00000gn/T/ipykernel_45032/271732862.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby("booking_window_bucket")["total_cost_eur"]

  booking_window_bucket  total_cost_eur
0              0–3 days        1,331.66
1              4–7 days        1,212.61
2             8–14 days        1,272.61
3            15–30 days        1,267.63
4              30+ days        1,294.19

In [25]:
flights = df[df["category"] == "Flight"]

cabin_spend = (
    flights.groupby("cabin_class")["total_cost_eur"]
           .agg(["sum", "mean", "count"])
           .reset_index()
           .sort_values("sum", ascending=False)
)

cabin_spend

       cabin_class          sum     mean  count
1          Economy 8,984,030.22 1,244.33   7220
2  Premium Economy 1,279,011.50 1,207.75   1059
0         Business   934,845.82 1,273.63    734

In [26]:
total_negotiated_savings = df["savings_vs_public_rate_eur"].sum()
avg_savings_per_trip = df["savings_vs_public_rate_eur"].mean()

total_negotiated_savings, avg_savings_per_trip

(1916094.4, 95.80471999999999)

In [27]:
neg_vs_non = (
    df.groupby("negotiated_rate_flag")
      .agg(
          trips=("trip_id", "count"),
          spend_eur=("total_cost_eur", "sum"),
          savings_vs_public=("savings_vs_public_rate_eur", "sum")
      )
      .reset_index()
)

neg_vs_non

   negotiated_rate_flag  trips     spend_eur  savings_vs_public
0                 False   8081 10,321,964.22               0.00
1                  True  11919 15,312,283.58       1,916,094.40

In [6]:
## 7. Policy & Compliance
#- Overall non-compliant spend
#- Violations by reason
#- Violations by department
#- Leakage through non-preferred suppliers & direct bookings

In [29]:
non_compliant = df[~df["is_policy_compliant"]]

non_compliant_spend = non_compliant["total_cost_eur"].sum()
non_compliant_share = non_compliant_spend / total_spend_eur * 100

non_compliant_spend, non_compliant_share

(4426000.109999999, 17.26596444152342)

In [30]:
violations_by_reason = (
    non_compliant
    .groupby("policy_violation_reason")["total_cost_eur"]
    .sum()
    .reset_index()
    .sort_values("total_cost_eur", ascending=False)
)

violations_by_reason

     policy_violation_reason  total_cost_eur
0               Late booking    1,501,815.70
1     Non-preferred supplier    1,096,910.94
3                Over budget      658,953.34
4          Wrong cabin/class      647,368.77
2  Out-of-policy destination      520,951.36

In [31]:
compliance_by_dept = (
    df.groupby("employee_department")["is_policy_compliant"]
      .mean()
      .reset_index()
)

compliance_by_dept["compliance_pct"] = compliance_by_dept["is_policy_compliant"] * 100
compliance_by_dept.drop(columns="is_policy_compliant", inplace=True)

compliance_by_dept.sort_values("compliance_pct")

  employee_department  compliance_pct
2                  IT           80.93
0             Finance           81.54
4         Procurement           82.41
3          Operations           83.08
5               Sales           83.08
1                  HR           84.31

In [32]:
preferred_usage = (
    df.groupby("is_preferred_supplier")["total_cost_eur"]
      .sum()
      .reset_index()
)

preferred_usage

   is_preferred_supplier  total_cost_eur
0                  False    6,206,140.36
1                   True   19,428,107.44

In [33]:
channel_share = (
    df.groupby("booking_channel")["total_cost_eur"]
      .sum()
      .reset_index()
)

channel_share

        booking_channel  total_cost_eur
0  Direct with Supplier    2,463,630.83
1           Online Tool    6,277,444.53
2                   TMC   16,893,172.44

In [7]:
## 8. Supplier & Sustainability
#- Top suppliers by spend
#- Supplier satisfaction & complaints
#- CO₂ emissions by category and region

In [35]:
supplier_summary = (
    df.groupby("supplier_name")
      .agg(
          total_spend_eur=("total_cost_eur", "sum"),
          trips=("trip_id", "count"),
          avg_nps=("nps_score", "mean"),
          complaint_rate=("complaint_flag", "mean"),
          avg_sla_hours=("service_sla_hours", "mean")
      )
      .reset_index()
      .sort_values("total_spend_eur", ascending=False)
)

supplier_summary.head(15)

,supplier_name,total_spend_eur,trips,avg_nps,complaint_rate,avg_sla_hours
11,SummitPlanners,"4,414,446.79",494,0.65,0.02,13.08
6,EventPro Global,"4,277,078.39",503,3.18,0.03,12.36
10,NordicSky,"2,840,818.99",2254,2.83,0.03,12.32
7,GlobalWings,"2,832,286.97",2252,0.53,0.03,12.51
1,BlueOcean Air,"2,799,182.57",2253,-1.50,0.03,12.43
13,TransWorld Air,"2,725,599.01",2254,1.52,0.03,12.52
14,UrbanLodge,"1,186,779.55",1566,0.07,0.04,12.39
8,HarbourStay Hotels,"1,124,288.68",1492,-0.26,0.03,12.66
9,MetroInn,"1,121,736.53",1515,-1.00,0.03,12.53
3,Continental Suites,"1,090,584.57",1426,-0.81,0.03,12.53
2,CityCars,"259,204.20",674,-6.10,0.05,12.42
0,AutoRent,"249,574.37",663,0.87,0.04,12.25
4,DriveNow,"247,922.68",676,2.66,0.03,12.60
5,EuroRail,"240,548.44",1029,1.02,0.02,12.66
12,TransContinental Rail,"224,196.06",949,0.08,0.03,12.53

In [36]:
co2_by_category = (
    df.groupby("category")["co2_tons"]
      .sum()
      .reset_index()
      .sort_values("co2_tons", ascending=False)
)

co2_by_category

            category  co2_tons
1             Flight  5,030.67
3  Meetings & Events  1,707.67
2              Hotel  1,320.11
0                Car    467.53
4               Rail    182.71

In [37]:
co2_by_region = (
    df.groupby("trip_region")["co2_tons"]
      .sum()
      .reset_index()
      .sort_values("co2_tons", ascending=False)
)

co2_by_region

  trip_region  co2_tons
2      Europe  4,408.93
1    Americas  1,735.13
0        APAC  1,694.63
3         MEA    870.00

In [38]:
co2_monthly = (
    df.groupby("year_month")["co2_tons"]
      .sum()
      .reset_index()
      .sort_values("year_month")
)

co2_monthly.head()

  year_month  co2_tons
0    2022-01     65.17
1    2022-02    179.70
2    2022-03    240.52
3    2022-04    237.93
4    2022-05    240.34

In [40]:
export_cols = [
    "trip_id",
    "employee_id",
    "employee_department",
    "employee_level",
    "cost_center",
    "travel_purpose",
    "home_region",
    "home_country",
    "home_city",
    "trip_region",
    "destination_country",
    "destination_city",
    "category",
    "booking_channel",
    "booking_date",
    "travel_start_date",
    "travel_end_date",
    "trip_length_days",
    "days_in_advance",
    "booking_window_bucket",
    "is_late_booking",
    "distance_km",
    "cabin_class",
    "hotel_star_rating",
    "car_group",
    "rail_class",
    "supplier_name",
    "base_fare",
    "taxes_fees",
    "total_cost",
    "currency",
    "fx_to_eur",
    "total_cost_eur",
    "year",
    "month",
    "year_month",
    "is_preferred_supplier",
    "is_policy_compliant",
    "policy_violation_reason",
    "negotiated_rate_flag",
    "savings_vs_public_rate_eur",
    "co2_kg",
    "co2_tons",
    "on_time_performance",
    "service_sla_hours",
    "complaint_flag",
    "nps_score"
]

df_export = df[export_cols].copy()
df_export.to_csv("clean_travel_data_for_powerbi.csv", index=False)

"Exported clean_travel_data_for_powerbi.csv"

'Exported clean_travel_data_for_powerbi.csv'

In [43]:
df_export.columns

Index(['trip_id', 'employee_id', 'employee_department', 'employee_level',
       'cost_center', 'travel_purpose', 'home_region', 'home_country',
       'home_city', 'trip_region', 'destination_country', 'destination_city',
       'category', 'booking_channel', 'booking_date', 'travel_start_date',
       'travel_end_date', 'trip_length_days', 'days_in_advance',
       'booking_window_bucket', 'is_late_booking', 'distance_km',
       'cabin_class', 'hotel_star_rating', 'car_group', 'rail_class',
       'supplier_name', 'base_fare', 'taxes_fees', 'total_cost', 'currency',
       'fx_to_eur', 'total_cost_eur', 'year', 'month', 'year_month',
       'is_preferred_supplier', 'is_policy_compliant',
       'policy_violation_reason', 'negotiated_rate_flag',
       'savings_vs_public_rate_eur', 'co2_kg', 'co2_tons',
       'on_time_performance', 'service_sla_hours', 'complaint_flag',
       'nps_score'],
      dtype='object')